app/Http/Controllers/Frontend/HomeController.php

select * from `sliders` where `status` = 1 order by `serial` asc
select * from `brands` where `status` = 1 and `is_featured` = 1
select * from `flash_sales` limit 1
select `product_id` from `flash_sale_items` where `show_at_home` = 1 and `status` = 1
select * from `home_page_settings` where `key` = 'popular_category_section' limit 1
---
    public function  index() {

        $sliders=Slider::where('status',1)->orderBy('serial','asc')->get();
        $brands = Brand::where('status', 1)->where('is_featured', 1)->get();

        $flashSaleDate = FlashSale::first();

        $flashSaleItems = FlashSaleItem::where('show_at_home', 1)->where('status', 1)->pluck('product_id')->toArray();
        $popularCategory = HomePageSetting::where('key', 'popular_category_section')->first();